"use client";

function About() {
  return (
    <div className="bg-[#EBEAFF] min-h-screen text-[#3D3BF3] rtl">
      <div className="max-w-6xl mx-auto py-12 px-8">
        <h1 className="text-5xl font-bold text-center text-[#FF2929] mb-10">
          PlanIt – הזמן בידיים שלך
        </h1>
        <p className="text-xl leading-relaxed text-right mb-6">
          PlanIt היא לא סתם מערכת לניהול משימות, אלא מערכת חכמה שמביאה איתה שינוי דרמטי בדרך בה אתה מתכנן, מבצע ומנהל את הזמן שלך. המערכת עוזרת לך לשמור על סדר ופרודוקטיביות, תוך שמירה על איזון בין משימות אישיות וקבוצתיות. עם כלים מתקדמים וממשק אינטואיטיבי, PlanIt לא רק מאפשרת לך לתכנן את יומך, אלא גם לשתף פעולה עם אחרים בצורה פשוטה ויעילה. היא מתאימה לכל מי שמעוניין לשלוט על הזמן ולהשיג מטרות בקלות – בין אם אתה אדם פרטי, עובד צוות או מנהל פרויקט.
        </p>
        <p className="text-xl leading-relaxed text-right mb-6">
          אחת מהפונקציות המרכזיות במערכת היא יצירת משימות. לא משנה אם מדובר במשימה חד-פעמית או סדרת משימות חוזרות, PlanIt מאפשרת לך להגדיר את כל פרטיהן בצורה מותאמת אישית. תוכל/י לקשר משימה למספר משתמשים, לקבוע רמת עדיפות, תדירות, תאריך יעד ופרמטרים נוספים שיבטיחו שהמשימה תתבצע בצורה המיטבית. אם אתה רוצה לחסוך זמן, תוכל/י גם לבחור מתוך תבניות מוכנות מראש, כמו יום הולדת, קנייה ועוד. כל משימה תוכל לקבל את הגדרת הזמן שלה, כך שלא תפספס אף פרט חשוב.
        </p>
        <p className="text-xl leading-relaxed text-right mb-6">
          אם אתה מנהל מספר משימות או פרויקטים, תוכל/י ליצור פרויקט חדש ולקשר אליו משימות ו/או אנשים. כל משימה או פרויקט יוכל לכלול מספר משתמשים שיתעדכנו בזמן אמת אודות מצב המשימות וההתקדמות, דבר שמסייע לנהל את הצוות בצורה חלקה ויעילה. בנוסף, לכל פרויקט תוכל/י להקצות משימות שקשורות אליו, כך שניתן לנהל את כל המשימות תחת פרויקט מסודר ומאורגן.
        </p>
        <p className="text-xl leading-relaxed text-right mb-6">
          לא משנה איך אתה מעדיף לצפות במשימות שלך, PlanIt מציעה תצוגות גמישות שמתאימות לכל סגנון עבודה. תוכל/י לבחור לצפות במשימות כרשימה מסודרת או להציג אותן בלוח שנה יומי, שבועי או חודשי, כך שתהיה לך תמיד תמונת מצב עדכנית ומסודרת של כל מה שצריך לעשות.
        </p>
        <p className="text-xl leading-relaxed text-right mb-6">
          ולבסוף, PlanIt מביאה עמה מערכת התראות חכמה. תוכל/י לקבוע אילו התראות תרצה/י לקבל – על משימות דחופות, משימות שמתקרבות לתאריך יעד, משימות ששותפו איתך ועוד. המערכת תוודא שלא תפספס אף משימה קריטית, תוך שהיא מעדכנת אותך בדיוק בזמן.
        </p>
        <p className="text-xl leading-relaxed text-right">
          הזמן שלך הוא המשאב החשוב ביותר, ועם PlanIt תוכל/י לתכנן את כל משימותיך בצורה חכמה וממוקדת. כל משימה הופכת להזדמנות נוספת לשלוט על היום שלך, ולהשיג את כל מה שתמיד רצית – בצורה נוחה, מהירה ומסודרת. 
        </p>
        <p className="text-xl leading-relaxed text-right">
          <strong>הצטרף/י אלינו עוד היום ותגלה איך אפשר לתכנן עתיד מלא בהצלחה!</strong>
        </p>
      </div>
    </div>
  );
}

export default About;